gogia_spiralis/Re1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;	//1

vertices
(
    (-0.26 -0.13 0)
    (0.65 -0.13 0)
    (0.65 0.13 0)
    (-0.26 0.13 0)
    (-0.26 -0.13 0.26)
    (0.65 -0.13 0.26)
    (0.65 0.13 0.26)
    (-0.26 0.13 0.26)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (280 56 56) simpleGrading (1 1 1)  //(180 120 80)
);

edges
(
);

boundary
(
    inlet // atmosphere
    {
        type patch;  //patch
        faces
        (
         
          (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (        
          (1 2 6 5)
        );
    }
    leftRightTop
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (4 5 6 7)
        );
    }
    Bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);
 

// ************************************************************************* //
